# **Week #9-10 - CASE : DVD RENTAL ETL**

Intro to Data Engineering Course - Sekolah Engineer - Pacmann Academy

In [153]:
import pandas as pd
from tabulate import tabulate
import warnings

warnings.filterwarnings('ignore')

## 1. Data Source

### 1.1. Data Source I : API

- Data `city` : https://raw.githubusercontent.com/rahilpacmann/case-data-wrangling-api/main/city.csv

In [91]:
city_raw = "https://raw.githubusercontent.com/rahilpacmann/case-data-wrangling-api/main/city.csv"

### 1.2. Data Source II : API

- Data `country` : https://raw.githubusercontent.com/rahilpacmann/case-data-wrangling-api/main/country.csv

In [92]:
country_raw = "https://raw.githubusercontent.com/rahilpacmann/case-data-wrangling-api/main/country.csv"

### 1.3. Data Source III : Database

- ***NOTES : Pastikan anda sudah mempersiapkan Data Source 3. Silahkan lihat "Live Class Preparation" pada Chapter 9***

- Jika sudah mempersiapkan data source 3 buat koneksi ke database tersebut.
    - dbname = "dvdrental"
    - user = "postgres"
    - password = "qwerty123"
    - host = "localhost"
    - port = "5432"

In [93]:
# Your code here
# Buat koneksi ke database
import psycopg2
from sqlalchemy import create_engine

# koneksi data source
dbname = "dvdrental"
user = "postgres"
password = "qwerty123"
host = "localhost"
port = "5433"

engine_str = f"postgresql://{user}:{password}@{host}:{port}/{dbname}"
engine = create_engine(engine_str)

In [94]:
engine

Engine(postgresql://postgres:***@localhost:5433/dvdrental)

### 1.4. Requirements (JSON)

- Requirements :
    - https://rahilpacmann.github.io/case-data-wrangling-api/requirements_table.json
- Requirements tersebut meliputi :
    - Nama tabel
    - Nama kolom pada setiap tabel
    - Tipe data pada setiap tabel

In [95]:
requirements_table_url = 'https://rahilpacmann.github.io/case-data-wrangling-api/requirements_table.json'

- Load Json

In [98]:
# Your code here
import urllib.request, json

with urllib.request.urlopen(requirements_table_url) as url:
    requirements_table = json.load(url)

print(requirements_table.keys())

dict_keys(['actor', 'store', 'address', 'category', 'city', 'country', 'customer', 'film_actor', 'film_category', 'inventory', 'language', 'rental', 'staff', 'payment', 'film'])

## 2. Extract

### 2.1. Extract From Data Source I

- Lakukan ekstrak data dari Data Source I
- Simpan dataframenya dengan nama `city_df`

In [100]:
def extract_api_csv(api_link):
    df = pd.read_csv(api_link)
    return df

In [101]:
city_df = extract_api_csv(city_raw)

In [102]:
city_df.head()

   city_id                city               country
0        1  A Corua (La Corua)                 Spain
1        2                Abha          Saudi Arabia
2        3           Abu Dhabi  United Arab Emirates
3        4                Acua                Mexico
4        5               Adana                Turkey

### 2.2. Extract From Data Source II

- Lakukan ekstrak data dari Data Source II
- Simpan dataframenya dengan nama `country_df`

In [103]:
country_df = extract_api_csv(country_raw)

In [104]:
country_df.head()

          country          last_update
0     Afghanistan  2006-02-15 09:44:00
1         Algeria  2006-02-15 09:44:00
2  American Samoa  2006-02-15 09:44:00
3          Angola  2006-02-15 09:44:00
4        Anguilla  2006-02-15 09:44:00

### 2.3. Extract From Data Source III

- Buatlah function untuk mendapatkan tabel pada database
- Parameter :
    - nama tabel
    - engine koneksi ke database
- Return : dataframe

In [ ]:
# Your code here
# Buat koneksi ke database
import psycopg2
from sqlalchemy import create_engine

# koneksi data source
dbname = "dvdrental"
user = "postgres"
password = "qwerty123"
host = "localhost"
port = "5433"

engine_str = f"postgresql://{user}:{password}@{host}:{port}/{dbname}"
engine = create_engine(engine_str)

In [105]:
# Your code here
# Buat fungsi untuk mendapatkan tabel pada database
def get_table_data(table_name):
    dbname = "dvdrental"
    user = "postgres"
    password = "qwerty123"
    host = "localhost"
    port = "5433"

    engine_str = f"postgresql://{user}:{password}@{host}:{port}/{dbname}"
    engine = create_engine(engine_str)

    try:
        query = f"SELECT * FROM {table_name}"
        df = pd.read_sql(query, engine)

        return df

    except Exception as e:
        print(f"Error: {e}")

        return pd.DataFrame()

In [ ]:
pangres

In [ ]:
# Your code here
# Buat fungsi untuk mendapatkan tabel pada database
def get_table_name():
    dbname = "dvdrental"
    user = "postgres"
    password = "qwerty123"
    host = "localhost"
    port = "5433"

    engine_str = f"postgresql://{user}:{password}@{host}:{port}/{dbname}"
    engine = create_engine(engine_str)

    try:
        query = """
        TRUNCATE TABLE a Cascade;
        """
        df = pd.read_sql(query, engine)

        return df

    except Exception as e:
        print(f"Error: {e}")

        return pd.DataFrame()

In [113]:
df_column = get_table_name()
df_column

       table_name
0           actor
1           store
2         address
3        category
4        customer
5      film_actor
6   film_category
7       inventory
8        language
9          rental
10          staff
11        payment
12           film

In [ ]:

list_data = {}

for table_name in df_column['table_name']:
    list_data[table_name] = get_table_data(table_name)

- Buat masing-masing dataframe untuk setiap table tersebut

In [106]:
actor_df = get_table_data('actor')
store_df = get_table_data('store')
address_df = get_table_data('address')
category_df = get_table_data('category')
customer_df = get_table_data('customer')
film_actor_df = get_table_data('film_actor')
film_category_df = get_table_data('film_category')
inventory_df = get_table_data('inventory')
language_df = get_table_data('language')
rental_df = get_table_data('rental')
staff_df = get_table_data('staff')
payment_df = get_table_data('payment')
film_df = get_table_data('film')

In [107]:
film_category_df

     film_id  category_id         last_update
0          1            6 2006-02-15 10:07:09
1          2           11 2006-02-15 10:07:09
2          3            6 2006-02-15 10:07:09
3          4           11 2006-02-15 10:07:09
4          5            8 2006-02-15 10:07:09
..       ...          ...                 ...
995      996            6 2006-02-15 10:07:09
996      997           12 2006-02-15 10:07:09
997      998           11 2006-02-15 10:07:09
998      999            3 2006-02-15 10:07:09
999     1000            5 2006-02-15 10:07:09

[1000 rows x 3 columns]

- Rampung semua dataframe dari Data Source 1, 2, dan 3 ke dalam sebuah **Dictionary**.
- Keys:
    - nama tabel
- Value:
    - dataframe

In [108]:
# Your code here
table_dict = {'actor': actor_df,
              'store' : store_df,
              'address' : address_df,
              'category' :category_df,
              'customer' : customer_df,
              'film_actor' : film_actor_df,
              'film_category' : film_category_df,
              'inventory' : inventory_df,
              'language' : language_df,
              'rental' : rental_df,
              'staff' : staff_df,
              'payment' : payment_df,
              'film' : film_df,
              'city' : city_df,
              'country' : country_df}

In [110]:
table_dict['customer']

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1
...,...,...,...,...,...,...,...,...,...,...
594,595,1,Terrence,Gunderson,terrence.gunderson@sakilacustomer.org,601,True,2006-02-14,2013-05-26 14:49:45.738,1
595,596,1,Enrique,Forsythe,enrique.forsythe@sakilacustomer.org,602,True,2006-02-14,2013-05-26 14:49:45.738,1
596,597,1,Freddie,Duggan,freddie.duggan@sakilacustomer.org,603,True,2006-02-14,2013-05-26 14:49:45.738,1
597,598,1,Wade,Delvalle,wade.delvalle@sakilacustomer.org,604,True,2006-02-14,2013-05-26 14:49:45.738,1
598,599,2,Austin,Cintron,austin.cintron@sakilacustomer.org,605,True,2006-02-14,2013-05-26 14:49:45.738,1

## 3. Data Validations

- Pada bagian ini akan dilakukan beberapa **pengecekan**, yaitu :
    - Check `Table Requirements`
    - Check Data `Shape`
    - Check `Columns`
    - Check Data `Types`
    - Check `Missing Values`
    - Check `Duplicates Data`

### 3.1. Check `Table Requirements`

- Pada bagian ini kita akan melakukan **pengecekan daftar tabel**.
- Pengecekan dilakukan pada : -> table_dict
    - Data Source I
    - Data Source II
    - Data Source III
- Pastikan tabel yang dimiliki dari data source sesuai dengan requirements table.

- Buat fungsi pengecekan Tabel : **check_table_requirements**
- Fungsi ini akan :
    - Memprint tabulate dengan header nama tabel dan hasil pengecekan tabel tersebut. ✓ jika tabelnya ada dan ✗ jika tabelnya tidak ada
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [122]:
table_dict.keys()

dict_keys(['actor', 'store', 'address', 'category', 'customer', 'film_actor', 'film_category', 'inventory', 'language', 'rental', 'staff', 'payment', 'film', 'city', 'country'])

In [124]:
# Your code here
def check_table_requirements(actual_table, requirements_table):

    actual_table_name = list(actual_table.keys())
    requirements_table_name = list(requirements_table.keys())
    table_checking = []

    for table_name in requirements_table_name:

        if table_name in actual_table_name:
            table_checking.append([table_name, "✓"]) 

        else:
            table_checking.append([table_name, "✗"])

    table_headers = ['Table_name', 'Is_Exist']
    table = tabulate(table_checking, headers = table_headers, tablefmt = 'grid')
    print("=> STEP 1: Check Table")
    print(table)

In [125]:
check_table_requirements(actual_table = table_dict,
                         requirements_table = requirements_table)

=> STEP 1: Check Table
+---------------+------------+
| Table_name    | Is_Exist   |
+===============+============+
| actor         | ✓          |
+---------------+------------+
| store         | ✓          |
+---------------+------------+
| address       | ✓          |
+---------------+------------+
| category      | ✓          |
+---------------+------------+
| city          | ✓          |
+---------------+------------+
| country       | ✓          |
+---------------+------------+
| customer      | ✓          |
+---------------+------------+
| film_actor    | ✓          |
+---------------+------------+
| film_category | ✓          |
+---------------+------------+
| inventory     | ✓          |
+---------------+------------+
| language      | ✓          |
+---------------+------------+
| rental        | ✓          |
+---------------+------------+
| staff         | ✓          |
+---------------+------------+
| payment       | ✓          |
+---------------+------------+
| film          | ✓          |
+---------------+------------+

### 3.2. Check `Data Shape`

- Buat fungsi pengecekan data shape : **check_shape**
- Fungsi ini akan :
    - Memprint tabulate untuk menampilkan jumlah baris dan jumlah kolom dari setiap table.
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [126]:
# Your code here
def check_shape(actual_table):
    print("=> STEP 2: Check Data Shape")
    shape_checking = []

    for table_name in actual_table:
        n_row = actual_table[table_name].shape[0]
        n_col = actual_table[table_name].shape[1]
        shape_checking.append([table_name, n_row, n_col])

    # Print Table
    table_headers = ['Table_name', 'Number of rows', 'Number of columns']
    table = tabulate(shape_checking, headers = table_headers, tablefmt = 'grid')
    print(table)

In [127]:
check_shape(actual_table = table_dict)

=> STEP 2: Check Data Shape
+---------------+------------------+---------------------+
| Table_name    |   Number of rows |   Number of columns |
+===============+==================+=====================+
| actor         |              200 |                   4 |
+---------------+------------------+---------------------+
| store         |                2 |                   4 |
+---------------+------------------+---------------------+
| address       |              603 |                   8 |
+---------------+------------------+---------------------+
| category      |               16 |                   3 |
+---------------+------------------+---------------------+
| customer      |              599 |                  10 |
+---------------+------------------+---------------------+
| film_actor    |             5462 |                   3 |
+---------------+------------------+---------------------+
| film_category |             1000 |                   3 |
+---------------+------------------+---------------------+
| inventory     |             4581 |                   4 |
+---------------+------------------+---------------------+
| language      |                6 |                   3 |
+---------------+------------------+---------------------+
| rental        |            16044 |                   7 |
+---------------+------------------+---------------------+
| staff         |                2 |                  11 |
+---------------+------------------+---------------------+
| payment       |            14596 |                   6 |
+---------------+------------------+---------------------+
| film          |             1000 |                  13 |
+---------------+------------------+---------------------+
| city          |              677 |                   3 |
+---------------+------------------+---------------------+
| country       |              109 |                   2 |
+---------------+------------------+---------------------+

### 3.3. Check `Columns`

- Buat fungsi pengecekan nama-nama kolom pada setiap tabel : **check_columns**
- Fungsi ini akan :
    - Memprint tabulate untuk menampilkan tabel-tabel yang kolomnya tidak sesuai dengan requirements
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [42]:
requirements_table

{'actor': [{'column_name': 'actor_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'first_name', 'data_type': 'object'},
  {'column_name': 'last_name', 'data_type': 'object'}],
 'store': [{'column_name': 'store_id', 'data_type': 'int64'},
  {'column_name': 'manager_staff_id', 'data_type': 'int64'},
  {'column_name': 'address_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'}],
 'address': [{'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'city_id', 'data_type': 'int64'},
  {'column_name': 'address_id', 'data_type': 'int64'},
  {'column_name': 'district', 'data_type': 'object'},
  {'column_name': 'phone', 'data_type': 'object'},
  {'column_name': 'postal_code', 'data_type': 'object'},
  {'column_name': 'address', 'data_type': 'object'},
  {'column_name': 'address2', 'data_type': 'object'}],
 'category': [{'column_name': 'category_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'name', 'data_type': 'object'}],
 'city': [{'column_name': 'city_id', 'data_type': 'int64'},
  {'column_name': 'country_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'city', 'data_type': 'object'}],
 'country': [{'column_name': 'country_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'country', 'data_type': 'object'}],
 'customer': [{'column_name': 'active', 'data_type': 'int64'},
  {'column_name': 'store_id', 'data_type': 'int64'},
  {'column_name': 'create_date', 'data_type': 'datetime64[ns]'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'customer_id', 'data_type': 'int64'},
  {'column_name': 'address_id', 'data_type': 'int64'},
  {'column_name': 'activebool', 'data_type': 'bool'},
  {'column_name': 'first_name', 'data_type': 'object'},
  {'column_name': 'last_name', 'data_type': 'object'},
  {'column_name': 'email', 'data_type': 'object'}],
 'film_actor': [{'column_name': 'actor_id', 'data_type': 'int64'},
  {'column_name': 'film_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'}],
 'film_category': [{'column_name': 'film_id', 'data_type': 'int64'},
  {'column_name': 'category_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'}],
 'inventory': [{'column_name': 'inventory_id', 'data_type': 'int64'},
  {'column_name': 'film_id', 'data_type': 'int64'},
  {'column_name': 'store_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'}],
 'language': [{'column_name': 'language_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'name', 'data_type': 'object'}],
 'rental': [{'column_name': 'rental_id', 'data_type': 'int64'},
  {'column_name': 'rental_date', 'data_type': 'datetime64[ns]'},
  {'column_name': 'inventory_id', 'data_type': 'int64'},
  {'column_name': 'customer_id', 'data_type': 'int64'},
  {'column_name': 'return_date', 'data_type': 'datetime64[ns]'},
  {'column_name': 'staff_id', 'data_type': 'int64'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'}],
 'staff': [{'column_name': 'picture', 'data_type': 'object'},
  {'column_name': 'address_id', 'data_type': 'int64'},
  {'column_name': 'store_id', 'data_type': 'int64'},
  {'column_name': 'active', 'data_type': 'bool'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'staff_id', 'data_type': 'int64'},
  {'column_name': 'first_name', 'data_type': 'object'},
  {'column_name': 'last_name', 'data_type': 'object'},
  {'column_name': 'password', 'data_type': 'object'},
  {'column_name': 'email', 'data_type': 'object'},
  {'column_name': 'username', 'data_type': 'object'}],
 'payment': [{'column_name': 'payment_id', 'data_type': 'int64'},
  {'column_name': 'customer_id', 'data_type': 'int64'},
  {'column_name': 'staff_id', 'data_type': 'int64'},
  {'column_name': 'rental_id', 'data_type': 'int64'},
  {'column_name': 'amount', 'data_type': 'float64'},
  {'column_name': 'payment_date', 'data_type': 'datetime64[ns]'}],
 'film': [{'column_name': 'fulltext', 'data_type': 'object'},
  {'column_name': 'rating', 'data_type': 'object'},
  {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
  {'column_name': 'film_id', 'data_type': 'int64'},
  {'column_name': 'release_year', 'data_type': 'int64'},
  {'column_name': 'language_id', 'data_type': 'int64'},
  {'column_name': 'rental_duration', 'data_type': 'int64'},
  {'column_name': 'rental_rate', 'data_type': 'float64'},
  {'column_name': 'length', 'data_type': 'int64'},
  {'column_name': 'replacement_cost', 'data_type': 'float64'},
  {'column_name': 'title', 'data_type': 'object'},
  {'column_name': 'description', 'data_type': 'object'},
  {'column_name': 'special_features', 'data_type': 'object'}]}

In [43]:
x = requirements_table['actor']

requirements_columns = []
for column in x:
    requirements_columns.append(column['column_name'])

requirements_columns

['actor_id', 'last_update', 'first_name', 'last_name']

In [130]:
requirements_table['actor']

[{'column_name': 'actor_id', 'data_type': 'int64'},
 {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
 {'column_name': 'first_name', 'data_type': 'object'},
 {'column_name': 'last_name', 'data_type': 'object'}]

In [151]:
# Your code here
def check_columns_func(actual_table, requirements_table):
    print("=> STEP 3: Check Columns")

    for table_name in requirements_table:
        result = []

        # dapatkan nama kolom untuk tabel aktual
        actual_columns = list(actual_table[table_name].columns)

        # dapatkan nama kolom untuk table req
        requirements_columns = []
        requirements_table_data = requirements_table[table_name]
        for column in requirements_table_data:
            requirements_columns.append(column['column_name'])

        for column_name in set(actual_columns + requirements_columns):
            in_actual_table = '✔' if column_name in actual_columns else '✘'
            in_requirements_table = '✔' if column_name in requirements_columns else '✘'
            result.append([column_name, in_actual_table, in_requirements_table])

        if set(actual_columns) == set(requirements_columns):
            pass

        else:
            headers = ["column_name", "in_actual_table", "in_requirements_table"]
            print(f"Table : {table_name}")
            print(tabulate(result, headers = headers, tablefmt = "grid"))
            print("\n")

In [131]:
check_columns(actual_table = table_dict,
              requirements_table = requirements_table)

=> STEP 3: Check Columns
Table : city
+---------------+-------------------+-------------------------+
| column_name   | in_actual_table   | in_requirements_table   |
+===============+===================+=========================+
| country_id    | ✘                 | ✔                       |
+---------------+-------------------+-------------------------+
| city_id       | ✔                 | ✔                       |
+---------------+-------------------+-------------------------+
| last_update   | ✘                 | ✔                       |
+---------------+-------------------+-------------------------+
| country       | ✔                 | ✘                       |
+---------------+-------------------+-------------------------+
| city          | ✔                 | ✔                       |
+---------------+-------------------+-------------------------+


Table : country
+---------------+-------------------+-------------------------+
| column_name   | in_actual_table   | in_requirements_table   |
+===============+===================+=========================+
| country_id    | ✘                 | ✔                       |
+---------------+-------------------+-------------------------+
| last_update   | ✔                 | ✔                       |
+---------------+-------------------+-------------------------+
| country       | ✔                 | ✔                       |
+---------------+-------------------+-------------------------+

### 3.4. Check `Data Types`

- Buat fungsi pengecekan nama-nama kolom pada setiap tabel : **check_data_types**
- Fungsi ini akan :
    - Memprint tabulate untuk menampilkan tabel dan kolom yang tipe datanya tidak sesuai dengan requirements
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [170]:
# Your code here
def check_data_types(actual_table, requirements_table):
    print("=> STEP 4: Check Data Types")
    summary_data = []

    for table_name, df in actual_table.items():
        if table_name in requirements_table:
            for column_info in requirements_table[table_name]:
                column_name = column_info["column_name"]
                requirements_type = column_info["data_type"]

                if column_name in df.columns:
                    actual_type = str(df[column_name].dtype)
                    match = "✔" if actual_type == requirements_type else "✘"
                    summary_data.append([table_name, column_name, actual_type, requirements_type, match])
                else:
                    summary_data.append([table_name, column_name, "N/A", requirements_type, "✘ (Column not found)"])

    headers = ["Table Name", "Column Name", "Actual Type", "Requirements Type", "Match"]

    mismatch_data = [row for row in summary_data if "✘" in row[4]]

    if mismatch_data:
        print("\nSummary of Mismatches Data Types:")
        print(tabulate(mismatch_data, headers = headers, tablefmt = "grid"))

    else:
        print("All Data Types Match")

In [171]:
check_data_types(actual_table = table_dict,
                 requirements_table = requirements_table)

=> STEP 4: Check Data Types

Summary of Mismatches Data Types:
+--------------+---------------+---------------+---------------------+---------+
| Table Name   | Column Name   | Actual Type   | Requirements Type   | Match   |
+==============+===============+===============+=====================+=========+
| customer     | create_date   | object        | datetime64[ns]      | ✘       |
+--------------+---------------+---------------+---------------------+---------+
| city         | country_id    | float64       | int64               | ✘       |
+--------------+---------------+---------------+---------------------+---------+
| city         | last_update   | object        | datetime64[ns]      | ✘       |
+--------------+---------------+---------------+---------------------+---------+
| country      | last_update   | object        | datetime64[ns]      | ✘       |
+--------------+---------------+---------------+---------------------+---------+

### 3.5. Check `Missing Values`

- Buat fungsi pengecekan nama-nama kolom pada setiap tabel : **check_missing_values**
- Fungsi ini akan :
    - Memprint tabulate untuk menampilkan tabel dan kolom yang mempunyai missing values.
    - Menampilkan jumlah dan persentase missing values
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [164]:
# Your code here
def check_missing_values(actual_table):
    print("=> STEP 5: Check Missing Values")

    missing_summary = []

    for table_name, df in actual_table.items():
        missing_count = df.isnull().sum()
        missing_percentage = (df.isnull().mean() * 100).round(2)

        for column_name, count in missing_count.items():
            if count > 0:
                percentage = missing_percentage[column_name]
                missing_summary.append([table_name, column_name, count, percentage])

    if missing_summary:
        print("Missing Value Summary:")
        print(tabulate(missing_summary, headers=["Table Name", "Column Name", "Missing Value Count", "Missing Value Percentage"], tablefmt="grid"))

    else:
        print("There's no Missing Values")

In [136]:
check_missing_values(actual_table = table_dict)

=> STEP 5: Check Missing Values
Missing Value Summary:
+--------------+---------------+-----------------------+----------------------------+
| Table Name   | Column Name   |   Missing Value Count |   Missing Value Percentage |
+==============+===============+=======================+============================+
| address      | address2      |                     4 |                       0.66 |
+--------------+---------------+-----------------------+----------------------------+
| rental       | return_date   |                   183 |                       1.14 |
+--------------+---------------+-----------------------+----------------------------+
| staff        | picture       |                     1 |                      50    |
+--------------+---------------+-----------------------+----------------------------+
| city         | city          |                    10 |                       1.48 |
+--------------+---------------+-----------------------+----------------------------+
| city         | country       |                     7 |                       1.03 |
+--------------+---------------+-----------------------+----------------------------+

### 3.6. Check `Duplicates Data`

- Buat fungsi pengecekan nama-nama kolom pada setiap tabel : **check_duplicates_data**
- Fungsi ini akan :
    - Memprint tabulate untuk menampilkan tabel yang mempunyai data duplikat.
    - Menampilkan jumlah data yang duplikat (Semua data yang terindikasi duplikat).
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
    - requirements_table : Requirements JSON
- Return : None

In [137]:
# Your code here
def check_duplicates_data(actual_table):
    print("=> STEP 6: Check Duplicates Data")
    duplicate_summary = []

    for table_name, df in actual_table.items():
        try:
            duplicate_rows = df[df.duplicated(keep = False)]

            if not duplicate_rows.empty:
                duplicate_summary.append([table_name, len(duplicate_rows)])
        except:
            pass

    if duplicate_summary:
        print("Duplicate Data Summary:")
        print(tabulate(duplicate_summary, headers=["Table Name", "Duplicate Rows Count"], tablefmt="grid"))
    else:
        print("No Duplicate Data Found")

In [138]:
check_duplicates_data(table_dict)

=> STEP 6: Check Duplicates Data
Duplicate Data Summary:
+--------------+------------------------+
| Table Name   |   Duplicate Rows Count |
+==============+========================+
| city         |                    154 |
+--------------+------------------------+

## 4. Data Transform

- Proses transformasi ini dilakukan untuk **mempersiapkan data untuk diload ke Data Warehouse.**
- **Pertama, lakukanlah cleaning** sebelum datanya diload ke data warehouse **pada database dvdrental_clean**.
<center>

<img src="https://sekolahdata-assets.s3.ap-southeast-1.amazonaws.com/notebook-images/mde-intro-to-data-eng/10_01.png"/>
<center>

### 4.1. Data Cleansing

- Berdasarkan **hasil validations** diketahui bahwa data yang diperoleh dari beberapa data source **masih belum clean.**
    - **Kolom yang tidak sesuai requirements terdapat pada tabel:**
	    - city
	    - country
    - **Terdapat missing values pada kolom :**
	    - address
	    - city
	    - rental
	    - staff
    - **Tipe data yang tidak sesuai requirements terdapat pada tabel :**
	    - city
	    - country
	    - customer
    - **Terdapat duplicates data pada kolom :**
	    - city

- Oleh karena itu, kita akan bersihkan datanya terlebih dahulu.

#### 4.1.1. Handle mismatch columns

**TABLE : country**

- Berikut adalah **data aktual** dari tabel "country"

In [142]:
country_df = table_dict['country']
country_df.head()

          country          last_update
0     Afghanistan  2006-02-15 09:44:00
1         Algeria  2006-02-15 09:44:00
2  American Samoa  2006-02-15 09:44:00
3          Angola  2006-02-15 09:44:00
4        Anguilla  2006-02-15 09:44:00

- Berikut adalah **requirements** untuk tabel "country"

In [141]:
requirements_table['country']

[{'column_name': 'country_id', 'data_type': 'int64'},
 {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
 {'column_name': 'country', 'data_type': 'object'}]

In [143]:
country_df['country_id'] = country_df.index + 1

In [144]:
country_df

                  country          last_update  country_id
0             Afghanistan  2006-02-15 09:44:00           1
1                 Algeria  2006-02-15 09:44:00           2
2          American Samoa  2006-02-15 09:44:00           3
3                  Angola  2006-02-15 09:44:00           4
4                Anguilla  2006-02-15 09:44:00           5
..                    ...                  ...         ...
104               Vietnam  2006-02-15 09:44:00         105
105  Virgin Islands, U.S.  2006-02-15 09:44:00         106
106                 Yemen  2006-02-15 09:44:00         107
107            Yugoslavia  2006-02-15 09:44:00         108
108                Zambia  2006-02-15 09:44:00         109

[109 rows x 3 columns]

- Pada table country aktual belum mempunyai kolom country_id, maka :
    - **tambahkan colom country_id.**
- Ketentuan :
    - country_id tersebut dimulai dari angka 1 dan seterusnya

In [55]:
# Your code here
# Menambahkan kolom baru 'country_id' di posisi pertama
country_df.insert(0, 'country_id', range(1, len(country_df) + 1))

country_df.head()

   country_id         country          last_update
0           1     Afghanistan  2006-02-15 09:44:00
1           2         Algeria  2006-02-15 09:44:00
2           3  American Samoa  2006-02-15 09:44:00
3           4          Angola  2006-02-15 09:44:00
4           5        Anguilla  2006-02-15 09:44:00

- **Rubah dataframe country pada table_dict**

In [ ]:
# Your code here
table_dict['country'] = country_df

In [160]:
table_dict['country']

                  country          last_update  country_id
0             Afghanistan  2006-02-15 09:44:00           1
1                 Algeria  2006-02-15 09:44:00           2
2          American Samoa  2006-02-15 09:44:00           3
3                  Angola  2006-02-15 09:44:00           4
4                Anguilla  2006-02-15 09:44:00           5
..                    ...                  ...         ...
104               Vietnam  2006-02-15 09:44:00         105
105  Virgin Islands, U.S.  2006-02-15 09:44:00         106
106                 Yemen  2006-02-15 09:44:00         107
107            Yugoslavia  2006-02-15 09:44:00         108
108                Zambia  2006-02-15 09:44:00         109

[109 rows x 3 columns]

**TABLE : city**

- Berikut adalah **data aktual** pada tabel "city".

In [57]:
city_df = table_dict['city']

city_df.head()

   city_id                city               country
0        1  A Corua (La Corua)                 Spain
1        2                Abha          Saudi Arabia
2        3           Abu Dhabi  United Arab Emirates
3        4                Acua                Mexico
4        5               Adana                Turkey

- Berikut adalah **requirements** untuk table "city".

In [58]:
requirements_table['city']

[{'column_name': 'city_id', 'data_type': 'int64'},
 {'column_name': 'country_id', 'data_type': 'int64'},
 {'column_name': 'last_update', 'data_type': 'datetime64[ns]'},
 {'column_name': 'city', 'data_type': 'object'}]

- Pada tabel city :
    - **Buat kolom :**
        - country_id
        - last_update
    - **Hapus kolom :**
        - country
- Untuk mencapai tujuan tersebut, lakukan **merge dengan table country** untuk **mendapatkan data country_id dan last_update**.

In [156]:
# Your code here
city_df = city_df.merge(country_df, on = 'country', how = 'left')

city_df = city_df[['city_id', 'country_id', 'city', 'last_update']]

city_df.head()

   city_id  country_id                city          last_update
0        1        87.0  A Corua (La Corua)  2006-02-15 09:44:00
1        2        82.0                Abha  2006-02-15 09:44:00
2        3       101.0           Abu Dhabi  2006-02-15 09:44:00
3        4        60.0                Acua  2006-02-15 09:44:00
4        5        97.0               Adana  2006-02-15 09:44:00

- **Rubah dataframe city pada table_dict**

In [157]:
# Your code here
table_dict['city'] = city_df

In [158]:
table_dict['city']

     city_id  country_id                city          last_update
0          1        87.0  A Corua (La Corua)  2006-02-15 09:44:00
1          2        82.0                Abha  2006-02-15 09:44:00
2          3       101.0           Abu Dhabi  2006-02-15 09:44:00
3          4        60.0                Acua  2006-02-15 09:44:00
4          5        97.0               Adana  2006-02-15 09:44:00
..       ...         ...                 ...                  ...
672      596         NaN                 NaN                  NaN
673      597         NaN                 NaN                  NaN
674      598        51.0                 NaN  2006-02-15 09:44:00
675      599         NaN                 NaN                  NaN
676      600        83.0          Ziguinchor  2006-02-15 09:44:00

[677 rows x 4 columns]

- Setelah menyesuaikan kolom pada data aktual dengan requirements, **validasi** kolomnya kembali. Gunakan fungsi `check_columns`

In [162]:
check_columns_func(actual_table = table_dict,
              requirements_table = requirements_table)

=> STEP 3: Check Columns

- Hal tersebut menunjukkan kolom-kolom pada data aktual sudah sesuai dengan requirements.

#### 4.1.2. Handle Missing Values

- Pada proses handle missing values ini akan dilakukan dropping missing values

- **Buatlah fungsi** untuk remove missing values : **remove_missing_values**
- Fungsi ini akan :
    - Menghapus missing values pada setiap tabel.
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
- Return :
    - cleaned_actual_table : Dictionary actual table yang sudah bersih dari missing values

In [166]:
# Your code here
def remove_missing_values(actual_table):
    cleaned_actual_table = {}

    for table_name, df in actual_table.items():
        cleaned_df = df.dropna()
        cleaned_actual_table[table_name] = cleaned_df

    return cleaned_actual_table

- Update table_dict dengan data yang sudah tidak mempunyai missing values

In [167]:
# Your code here
table_dict = remove_missing_values(actual_table = table_dict)

- Validasi missing valuenya kembali. Gunakan fungsi **check_missing_values**

In [168]:
check_missing_values(actual_table = table_dict)

=> STEP 5: Check Missing Values
There's no Missing Values

- Dapat dilihat bahwa missing values sudah terhandle.

#### 4.1.3. Handle Data Types

- Pada proses handle data types akan dilakukan **casting tipe data** berdasarkan requirements yang telah diberikan.

- **Buatlah fungsi** untuk menghandle Data Types : **adjust_data_types**
- Fungsi ini akan :
    - Melakukan casting tipe data sesuai dengan requirements.
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
- Return :
    - cleaned_actual_table : Dictionary actual table yang sudah bersih dari missing values

In [172]:
# Your code here
def adjust_data_types(actual_table, requirements_table):
    adjusted_table_dict = {}

    for table_name, df in actual_table.items():
        if table_name in requirements_table:
            table_requirements = requirements_table[table_name]

            for column_info in table_requirements:
                column_name = column_info["column_name"]
                data_type = column_info["data_type"]

                if column_name in df.columns:
                    df[column_name] = df[column_name].astype(data_type)

            adjusted_table_dict[table_name] = df

    return adjusted_table_dict

- Update table_dict dengan data yang sudah sesuai tipe datanya

In [173]:
# Your code here
table_dict = adjust_data_types(actual_table = table_dict,
                               requirements_table = requirements_table)

- Validasi tipe data dari kolom pada setiap tabel. Gunakan fungsi **check_data_types**

In [174]:
check_data_types(actual_table = table_dict,
                 requirements_table = requirements_table)

=> STEP 4: Check Data Types
All Data Types Match

- Dapat dilihat bahwa tipe data pada data aktual sudah sesuai.

#### 4.1.4. Handle Duplicates Data

- Pada proses handling data yang duplikat, akan dilakukan **drop data yang duplikat dengan mempertahankan record data yang pertama**.

- Buatlah fungsi untuk menghandle Data Types : **remove_duplicates**
- Fungsi ini akan :
    - Melakukan drop data yang duplikat dengan mempertahankan record data yang pertama.
- Parameter :
    - actual_table : Dictionary actual table (Data source 1, 2, 3)
- Return :
    - cleaned_table_dict : Dictionary actual table yang sudah bersih dari missing values

In [175]:
# Your code here
def remove_duplicates(actual_table):
    cleaned_table_dict = {}

    for table_name, df in actual_table.items():
        if table_name == 'city':
            cleaned_df = df.drop_duplicates(keep = 'first')  # Menghapus data duplikat dengan mempertahankan record data yang pertama
            cleaned_table_dict[table_name] = cleaned_df

        else:
            cleaned_table_dict[table_name] = df

    return cleaned_table_dict

- Update table_dict dengan data yang sudah tidak mempunyai data duplikat

In [176]:
# Your code here
table_dict = remove_duplicates(table_dict)

- Validasi kembali data yang mengalami duplikat. Gunakan fungsi **check_duplicates_data**

In [177]:
check_duplicates_data(table_dict)

=> STEP 6: Check Duplicates Data
No Duplicate Data Found

### 4.2. Data Manipulation & Data Selection

- Pada bagian ini, kita akan coba **generate sebuah tabel** yang merupakan kombinasi dari beberapa tabel.
- Kita akan generate tabel `film_list`
- Tabel tersebut akan disimpan pada database **dvdrental_analysis**
- Tabel tersebut merupakan **kombinasi tabel :**
    - `actor`
    - `film_actor`
    - `film`
    - `film_category`
    - `category`
<center>
<img src="https://sekolahdata-assets.s3.ap-southeast-1.amazonaws.com/notebook-images/mde-intro-to-data-eng/10_02.png"/>

- Kolom-kolom yang akan kita **generate** adalah :
    - `fid` -> sama dengan film_id
    - `title` -> Judul film
    - `description` -> Deskripsi dari film
    - `category` -> Kategori film
    - `price` -> Harga film
    - `length` -> Durasi film
    - `rating` -> Rating film
    - `actors` -> Nama-nama aktor film tersebut

<center>
<img src="https://sekolahdata-assets.s3.ap-southeast-1.amazonaws.com/notebook-images/mde-intro-to-data-eng/10_03.png"/>
<center>

- Pertama, **persiapkan dataframe yang diperlukan.**
- Dapatkan dataframenya dari **table_dict**

In [71]:
# Your code here
category = table_dict['category']
film_category = table_dict['film_category']
film = table_dict['film']
film_actor = table_dict['film_actor']
actor = table_dict['actor']

- Gabungkan tabel-tabel yang diperlukan dengan melakukan **merge**.

- Merge : **Category -> film_category**
- on : **category_id**
- Join Type : **left join**
- Suffixes : ("_x1", "_y1")

In [185]:
# Your code here
# Buat dataframe "film_list" untuk menyimpan hasil merge
film_list = category.merge(film_category, how = 'left', on = 'category_id', suffixes = ("_x1", "_y1"))

# Tampilkan 5 data "film_list" teratas
film_list.head()

   category_id    name      last_update_x1  film_id      last_update_y1
0            1  Action 2006-02-15 09:46:27       19 2006-02-15 10:07:09
1            1  Action 2006-02-15 09:46:27       21 2006-02-15 10:07:09
2            1  Action 2006-02-15 09:46:27       29 2006-02-15 10:07:09
3            1  Action 2006-02-15 09:46:27       38 2006-02-15 10:07:09
4            1  Action 2006-02-15 09:46:27       56 2006-02-15 10:07:09

- Merge : **film_list -> film**
- on : **film_id**
- Join Type : **left join**
- Suffixes : ("_x2", "_y2")

In [186]:
# Your code here
# Update dataframe "film_list" untuk menyimpan hasil merge
film_list = film_list.merge(film, how = 'left', on = 'film_id', suffixes = ("_x2", "_y2"))

# Tampilkan 5 data "film_list" teratas
film_list.head(1).T

                                                                  0
category_id                                                       1
name                                                         Action
last_update_x1                                  2006-02-15 09:46:27
film_id                                                          19
last_update_y1                                  2006-02-15 10:07:09
title                                                  Amadeus Holy
description       A Emotional Display of a Pioneer And a Technic...
release_year                                                   2006
language_id                                                       1
rental_duration                                                   6
rental_rate                                                    0.99
length                                                          113
replacement_cost                                              20.99
rating                                                           PG
last_update                              2013-05-26 14:50:58.951000
special_features  [Commentaries, Deleted Scenes, Behind the Scenes]
fulltext          'amadeus':1 'baloon':20 'battl':15 'display':5...

- Merge : **film_list -> film_actor**
- on : **film_id**
- Join Type : **inner join**
- Suffixes : ("_x3", "_y3")

In [187]:
# Your code here
# Update dataframe "film_list" untuk menyimpan hasil merge
film_list = film_list.merge(film_actor, how = 'inner', on = 'film_id', suffixes = ("_x3", "_y3"))

# Tampilkan 5 data "film_list" teratas
film_list.head(1).T

                                                                  0
category_id                                                       1
name                                                         Action
last_update_x1                                  2006-02-15 09:46:27
film_id                                                          19
last_update_y1                                  2006-02-15 10:07:09
title                                                  Amadeus Holy
description       A Emotional Display of a Pioneer And a Technic...
release_year                                                   2006
language_id                                                       1
rental_duration                                                   6
rental_rate                                                    0.99
length                                                          113
replacement_cost                                              20.99
rating                                                           PG
last_update_x3                           2013-05-26 14:50:58.951000
special_features  [Commentaries, Deleted Scenes, Behind the Scenes]
fulltext          'amadeus':1 'baloon':20 'battl':15 'display':5...
actor_id                                                          5
last_update_y3                                  2006-02-15 10:05:03

- Merge : **film_list -> actor**
- on : **actor_id**
- Join Type : **inner join**
- Suffixes : ("_x4", "_y4")

In [190]:
# Your code here
# Update dataframe "film_list" untuk menyimpan hasil merge
film_list = film_list.merge(actor, how = 'inner', on = 'actor_id', suffixes = ("_x4", "_y4"))

# Tampilkan 5 data "film_list" teratas
film_list.head()

,category_id,name,last_update_x1,film_id,last_update_y1,title,description,release_year,language_id,rental_duration,...,replacement_cost,rating,last_update_x3,special_features,fulltext,actor_id,last_update_y3,first_name,last_name,last_update
0,1,Action,2006-02-15 09:46:27,19,2006-02-15 10:07:09,Amadeus Holy,A Emotional Display of a Pioneer And a Technic...,2006,1,6,...,20.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'amadeus':1 'baloon':20 'battl':15 'display':5...,5,2006-02-15 10:05:03,Johnny,Lollobrigida,2013-05-26 14:47:57.620
1,1,Action,2006-02-15 09:46:27,19,2006-02-15 10:07:09,Amadeus Holy,A Emotional Display of a Pioneer And a Technic...,2006,1,6,...,20.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'amadeus':1 'baloon':20 'battl':15 'display':5...,27,2006-02-15 10:05:03,Julia,Mcqueen,2013-05-26 14:47:57.620
2,1,Action,2006-02-15 09:46:27,19,2006-02-15 10:07:09,Amadeus Holy,A Emotional Display of a Pioneer And a Technic...,2006,1,6,...,20.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'amadeus':1 'baloon':20 'battl':15 'display':5...,37,2006-02-15 10:05:03,Val,Bolger,2013-05-26 14:47:57.620
3,1,Action,2006-02-15 09:46:27,19,2006-02-15 10:07:09,Amadeus Holy,A Emotional Display of a Pioneer And a Technic...,2006,1,6,...,20.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'amadeus':1 'baloon':20 'battl':15 'display':5...,43,2006-02-15 10:05:03,Kirk,Jovovich,2013-05-26 14:47:57.620
4,1,Action,2006-02-15 09:46:27,19,2006-02-15 10:07:09,Amadeus Holy,A Emotional Display of a Pioneer And a Technic...,2006,1,6,...,20.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'amadeus':1 'baloon':20 'battl':15 'display':5...,84,2006-02-15 10:05:03,James,Pitt,2013-05-26 14:47:57.620

- Selanjutnya, **gabungkan** `first_name` dan `last_name` menjadi `full_name`

In [191]:
# Gabungkan nama depan dan belakang aktor
film_list['full_name'] = film_list['first_name'] + ' ' + film_list['last_name']

# Tampilkan kolom "full_name"
film_list['full_name']

0       Johnny Lollobrigida
1             Julia Mcqueen
2                Val Bolger
3             Kirk Jovovich
4                James Pitt
               ...
5457             Val Bolger
5458           Kenneth Torn
5459            Lucille Dee
5460        Geoffrey Heston
5461           Rock Dukakis
Name: full_name, Length: 5462, dtype: object

- Perlu diketahui bahwa satu film bisa terdiri dari beberapa aktor.
- Oleh karena itu, **gabung nama-nama aktor tersebut di satu film yang sama**.
- Contoh :
    <center>
    <img src="https://sekolahdata-assets.s3.ap-southeast-1.amazonaws.com/notebook-images/mde-intro-to-data-eng/10_04.png"/>
    <center>

In [192]:
# Your code here
# Gabungkan nama aktor menjadi satu string untuk setiap film
film_list = film_list.groupby(['film_id', 'title', 'description', 'name', 'rental_rate', 'length', 'rating'])['full_name'].apply(lambda x: ', '.join(x))

# Tampilkan 5 data teratas
film_list.head()

film_id  title             description                                                                                                            name         rental_rate  length  rating
1        Academy Dinosaur  A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies                       Documentary  0.99         86      PG        Penelope Guiness, Christian Gable, Lucille Tra...
2        Ace Goldfinger    A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China                   Horror       4.99         48      G         Bob Fawcett, Minnie Zellweger, Sean Guiness, C...
3        Adaptation Holes  A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory                       Documentary  2.99         50      NC-17     Nick Wahlberg, Bob Fawcett, Cameron Streep, Ra...
4        Affair Prejudice  A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank                           Horror       2.99         117     G         Jodie Degeneres, Scarlett Damon, Kenneth Pesci...
5        African Egg       A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico  Family       2.99         130     G         Gary Phoenix, Dustin Tautou, Matthew Leigh, Ma...
Name: full_name, dtype: object

- Hasil tersebut **masih berupa "series"**
- Oleh karena itu, **rubah menjadi dataframe**

In [78]:
# Your code here
# Rubah dari series menjadi dataframe
film_list = pd.DataFrame(film_list)

# Tampilkan 5 data teratas
film_list.head()

                                                                                                                                                           full_name
film_id title            description                                        name        rental_rate length rating
1       Academy Dinosaur A Epic Drama of a Feminist And a Mad Scientist ... Documentary 0.99        86     PG      Penelope Guiness, Christian Gable, Lucille Tra...
2       Ace Goldfinger   A Astounding Epistle of a Database Administrato... Horror      4.99        48     G       Bob Fawcett, Minnie Zellweger, Sean Guiness, C...
3       Adaptation Holes A Astounding Reflection of a Lumberjack And a C... Documentary 2.99        50     NC-17   Nick Wahlberg, Bob Fawcett, Cameron Streep, Ra...
4       Affair Prejudice A Fanciful Documentary of a Frisbee And a Lumbe... Horror      2.99        117    G       Jodie Degeneres, Scarlett Damon, Kenneth Pesci...
5       African Egg      A Fast-Paced Documentary of a Pastry Chef And a... Family      2.99        130    G       Gary Phoenix, Dustin Tautou, Matthew Leigh, Ma...

In [79]:
film_list.columns

Index(['full_name'], dtype='object')

- Dapat dilihat, yang berstatus sebagai "kolom" hanya "full_name", selebihnya masih berupa index.
- Oleh karena itu, lakukan **reset index**

In [197]:
# Your code here
# Reset index
film_list = film_list.reset_index()

# Tampilkan 5 data teratas
film_list.head()

,film_id,title,description,name,rental_rate,length,rating,full_name
0,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"Penelope Guiness, Christian Gable, Lucille Tra..."
1,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"Bob Fawcett, Minnie Zellweger, Sean Guiness, C..."
2,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"Nick Wahlberg, Bob Fawcett, Cameron Streep, Ra..."
3,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"Jodie Degeneres, Scarlett Damon, Kenneth Pesci..."
4,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"Gary Phoenix, Dustin Tautou, Matthew Leigh, Ma..."

- Terakhir, **rubah nama kolom**.
    - `film_id` : `fid`
    - `name` : `category`
    - `rental_rate` : `price`
    - `full_name` : `actors`

In [195]:
# Your code here
# Buat mapping perubahan nama kolom
rename_column_map = {
    'film_id' : 'fid',
    'name' : 'category',
    'rental_rate' : 'price',
    'full_name' : 'actors'
}

In [198]:
# Your code here
# Rubah nama kolom
film_list.rename(columns = rename_column_map, inplace = True)

# Tampilkan 5 data teratas
film_list.head()

,fid,title,description,category,price,length,rating,actors
0,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"Penelope Guiness, Christian Gable, Lucille Tra..."
1,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"Bob Fawcett, Minnie Zellweger, Sean Guiness, C..."
2,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"Nick Wahlberg, Bob Fawcett, Cameron Streep, Ra..."
3,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"Jodie Degeneres, Scarlett Damon, Kenneth Pesci..."
4,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"Gary Phoenix, Dustin Tautou, Matthew Leigh, Ma..."

## 5. Load Data To Data Warehouse

- ***NOTES : Pastikan anda sudah mempersiapkan Data Warehousenya. Silahkan lihat "Live Class Preparation" pada Chapter 9***

### 5.1. Setup Connection

- Buat fungsi untuk membuat engine postgres.
    - user = "root"
    - password = "qwerty123"
    - host = "localhost"
    - port = "3000"
- Parameter : Nama database

In [178]:
# Your code here
def dw_postgres_engine(database_name):

    # Koneksi ke database
    user = "root"
    password = "qwerty123"
    host = "localhost"
    port = "3000"

    engine = create_engine(f"postgresql://{user}:{password}@{host}:{port}/{database_name}")

    return engine

### 5.2. Load to "dvdrental_clean" Database

#### 5.2.1. Create table

- Buatlah table untuk database tersebut.
- Gunakan schema berikut :
    ```sql
    -- Membuat skema public jika belum ada
    CREATE SCHEMA IF NOT EXISTS public;

    -- Buat tabel
    CREATE TABLE public.actor (
        actor_id SERIAL PRIMARY KEY,
        last_update TIMESTAMP,
        first_name VARCHAR,
        last_name VARCHAR
    );

    CREATE TABLE public.store (
        store_id SERIAL PRIMARY KEY,
        manager_staff_id INTEGER,
        address_id INTEGER,
        last_update TIMESTAMP
    );

    CREATE TABLE public.address (
        last_update TIMESTAMP,
        city_id INTEGER,
        address_id SERIAL PRIMARY KEY,
        district VARCHAR,
        phone VARCHAR,
        postal_code VARCHAR,
        address VARCHAR,
        address2 VARCHAR
    );

    CREATE TABLE public.category (
        category_id SERIAL PRIMARY KEY,
        last_update TIMESTAMP,
        name VARCHAR
    );

    CREATE TABLE public.city (
        city_id SERIAL PRIMARY KEY,
        country_id INTEGER,
        last_update TIMESTAMP,
        city VARCHAR
    );

    CREATE TABLE public.country (
        country_id SERIAL PRIMARY KEY,
        last_update TIMESTAMP,
        country VARCHAR
    );

    CREATE TABLE public.customer (
        active INTEGER,
        store_id INTEGER,
        create_date TIMESTAMP,
        last_update TIMESTAMP,
        customer_id SERIAL PRIMARY KEY,
        address_id INTEGER,
        activebool BOOLEAN,
        first_name VARCHAR,
        last_name VARCHAR,
        email VARCHAR
    );

    CREATE TABLE public.film_actor (
        actor_id SERIAL PRIMARY KEY,
        film_id INTEGER,
        last_update TIMESTAMP
    );

    CREATE TABLE public.film_category (
        film_id SERIAL PRIMARY KEY,
        category_id INTEGER,
        last_update TIMESTAMP
    );

    CREATE TABLE public.inventory (
        inventory_id SERIAL PRIMARY KEY,
        film_id INTEGER,
        store_id INTEGER,
        last_update TIMESTAMP
    );

    CREATE TABLE public.language (
        language_id SERIAL PRIMARY KEY,
        last_update TIMESTAMP,
        name VARCHAR
    );

    CREATE TABLE public.rental (
        rental_id SERIAL PRIMARY KEY,
        rental_date TIMESTAMP,
        inventory_id INTEGER,
        customer_id INTEGER,
        return_date TIMESTAMP,
        staff_id INTEGER,
        last_update TIMESTAMP
    );

    CREATE TABLE public.staff (
        picture VARCHAR,
        address_id INTEGER,
        store_id INTEGER,
        active BOOLEAN,
        last_update TIMESTAMP,
        staff_id SERIAL PRIMARY KEY,
        first_name VARCHAR,
        last_name VARCHAR,
        password VARCHAR,
        email VARCHAR,
        username VARCHAR
    );

    CREATE TABLE public.payment (
        payment_id SERIAL PRIMARY KEY,
        customer_id INTEGER,
        staff_id INTEGER,
        rental_id INTEGER,
        amount FLOAT,
        payment_date TIMESTAMP
    );

    CREATE TABLE public.film (
        fulltext VARCHAR,
        rating VARCHAR,
        last_update TIMESTAMP,
        film_id SERIAL PRIMARY KEY,
        release_year INTEGER,
        language_id INTEGER,
        rental_duration INTEGER,
        rental_rate FLOAT,
        length INTEGER,
        replacement_cost FLOAT,
        title VARCHAR,
        description VARCHAR,
        special_features VARCHAR
    );
```

#### 5.2.2. Load Data

- Lakukan load data ke "dvdrental_analysis" database

In [179]:
# Your code here
# Buat engine postgres
engine = dw_postgres_engine(database_name = 'dvdrental_clean')

# Iterasi melalui dictionary table_dict
for table_name, df in table_dict.items():
    # Insert data ke table
    df.to_sql(table_name, engine, if_exists = 'replace', index = False)

    # replace: drop, recreate, insert
    # append: insert

# Tutup koneksi ke database
engine.dispose()

### 5.3. Load to "dvdrental_analysis" Database

#### 5.3.1. Create Table

- Buatlah table untuk database tersebut.
- Gunakan schema berikut :
    ```sql
    -- Membuat skema public jika belum ada
    CREATE SCHEMA IF NOT EXISTS public;

    -- Membuat tabel film_list
    CREATE TABLE public.film_list (
        fid SERIAL PRIMARY KEY,
        title VARCHAR,
        description VARCHAR,
        category VARCHAR,
        price FLOAT,
        length INTEGER,
        rating VARCHAR,
        actors VARCHAR
    );
    ```

#### 5.3.2. Load Data

- Lakukan load data ke "dvdrental_analysis" database

In [199]:
# Your code here
# Buat engine postgres
engine = dw_postgres_engine(database_name = "dvdrental_analysis")

# Insert data ke table film_list
not_insert = ['film','actor','category','film_category','film_actor']
table_dict['film_list'] = film_list

# Iterasi melalui dictionary table_dict
for table_name, df in table_dict.items():
    if table_name not in not_insert:
        df.to_sql(table_name, engine, if_exists = 'replace', index = False)
engine.dispose()

In [87]:
# select * from film_list limit 5

film_list_query = """
SELECT * FROM film_list
"""

In [88]:
film_list_df = pd.read_sql(film_list_query, engine)

In [89]:
film_list_df

,fid,title,description,category,price,length,rating,actors
0,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"Penelope Guiness, Christian Gable, Lucille Tra..."
1,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"Bob Fawcett, Minnie Zellweger, Sean Guiness, C..."
2,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"Nick Wahlberg, Bob Fawcett, Cameron Streep, Ra..."
3,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"Jodie Degeneres, Scarlett Damon, Kenneth Pesci..."
4,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"Gary Phoenix, Dustin Tautou, Matthew Leigh, Ma..."
...,...,...,...,...,...,...,...,...
992,996,Young Language,A Unbelieveable Yarn of a Boat And a Database ...,Documentary,0.99,183,G,"Ed Chase, Julia Mcqueen, James Pitt, Christoph..."
993,997,Youth Kick,A Touching Drama of a Teacher And a Cat who mu...,Music,0.99,179,NC-17,"Sandra Kilmer, Val Bolger, Scarlett Bening, Ia..."
994,998,Zhivago Core,A Fateful Yarn of a Composer And a Man who mus...,Horror,0.99,105,NC-17,"Uma Wood, Nick Stallone, Gary Penn, Salma Nolt..."
995,999,Zoolander Fiction,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"Carmen Hunt, Mary Tandy, Penelope Cronyn, Whoo..."
996,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,Comedy,4.99,50,NC-17,"Ian Tandy, Nick Degeneres, Lisa Monroe"